Gawson/taskcerber/firmware/sdkconfig.defaults
#==============================================================================
# LilyGo T5 E-Paper S3 Pro — ESP32-S3-WROOM-1-N16R8 (16 MB QIO flash, 8 MB OPI PSRAM)
# TYLKO DEEP SLEEP. Żadnego light sleepa na ścieżce bateryjnej — patrz docs/power.md.
#==============================================================================

#--- Target / flash ------------------------------------------------------------
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_OCT_FLASH=n
CONFIG_ESPTOOLPY_FLASH_MODE_AUTO_DETECT=n

#--- Tablica partycji ----------------------------------------------------------
# Zostawiona na domyślnej ESP-IDF CELOWO. CONFIG_PARTITION_TABLE_CUSTOM_FILENAME jest
# rozwiązywane względem katalogu projektu CMake, który esp-idf-sys generuje w OUT_DIR,
# a NIE względem katalogu crate'a. Prawdziwą tablicę buduje espflash z ./partitions.csv.
CONFIG_PARTITION_TABLE_SINGLE_APP=y
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y

#--- PSRAM OCTAL ---------------------------------------------------------------
# 80 MHz, nie 120 jak w platformio.ini vendora: na S3 octal tryb 120 MHz zależy od
# SPIRAM_MODE_QUAD albo IDF_EXPERIMENTAL_FEATURES, a Kconfig ostrzega przed padami
# przy wahaniach ~20 °C. To urządzenie na baterii, wiszące na ścianie.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=n
# Memtest kosztuje ~100 ms przy każdym wybudzeniu. WŁĄCZ na czas bring-upu (M1/M2).
CONFIG_SPIRAM_MEMTEST=n
CONFIG_SPIRAM_ECC_ENABLE=n
CONFIG_SPIRAM_USE_MALLOC=y
# Alokacje >4 KB idą do PSRAM — to uwalnia wewnętrzny DRAM na bufory mbedTLS.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# epdiy kompiluje lut.c z -mno-fix-esp32-psram-cache-issue; wykonywanie kodu z PSRAM
# zmienia zachowanie cache'u pod jego gorącą pętlą DMA.
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=n
CONFIG_SPIRAM_RODATA=n

#--- CPU: race to sleep --------------------------------------------------------
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Linia cache'u danych: 64 B, NIE domyślne 32 B.
# To nie jest strojenie, tylko warunek, pod którym epdiy w ogóle jedzie z pełną
# prędkością. `lcd_driver.c:405-424` sprawdza EPDIY_DATA_CACHE_LINE_SIZE i przy
# wartości < 64 SAM POŁOWI zegar piksela:
#     lcd.config.pixel_clock = lcd.config.pixel_clock / 2;
# ED047TC1 deklaruje bus_speed 20 MHz (`displays.c`), więc przy 32 B panel chodził
# na 10 MHz i KAŻDA liczba czasu odświeżania była dwa razy większa: linia 25 µs
# zamiast 13, klatka 13,6 ms zamiast 7,1, DU 68 ms zamiast 35, pełne odświeżenie
# ~1,7 s zamiast ~0,9. epdiy krzyczy o tym trzema ESP_LOGE przy każdym starcie.
# 64 B to zresztą wymóg burstu DMA do PSRAM, nie kaprys.
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# Tick 1 ms zamiast 10 ms.
# Przy domyślnych 100 Hz `std::thread::sleep` poniżej jednego ticku nie usypia
# wątku, tylko kręci busy-waitem — a wątek dotyku śpi po 8 ms i ma priorytet
# wyższy niż pętla rysująca, więc zajeżdżał rdzeń dokładnie wtedy, gdy główny
# wątek składał klatkę. Do tego `vTaskDelay(1)` w `epd_board_poweron` i
# `epd_board_poweroff` epdiy kosztowało po 10 ms w każdą stronę, a granulacja
# pętli okna interaktywnego wynosiła 10-20 ms na obrót.
CONFIG_FREERTOS_HZ=1000

#--- Sen: wyłącznie głęboki ----------------------------------------------------
CONFIG_PM_ENABLE=n
CONFIG_FREERTOS_USE_TICKLESS_IDLE=n
CONFIG_BOOTLOADER_SKIP_VALIDATE_IN_DEEP_SLEEP=y
CONFIG_ESP_SLEEP_GPIO_RESET_WORKAROUND=y
# Po ~10 µA każdy, WYMAGANE na modułach WROOM.
CONFIG_ESP_SLEEP_FLASH_LEAKAGE_WORKAROUND=y
CONFIG_ESP_SLEEP_PSRAM_LEAKAGE_WORKAROUND=y
CONFIG_ESP_SLEEP_MSPI_NEED_ALL_IO_PU=y
# CONFIG_ESP_SLEEP_POWER_DOWN_FLASH jest NIEWYBIERALNE na S3 z SPIRAM — jego Kconfig to
#   depends on !SPIRAM || ESP_LDO_RESERVE_PSRAM || SOC_PSRAM_HAS_DEDICATED_LDO
# a SOC_PSRAM_HAS_DEDICATED_LDO nie istnieje w esp32s3/soc_caps.h. Twarda zależność,
# nie pokrętło. Bez znaczenia przy deep sleepie.
# NIGDY nie wołaj esp_sleep_pd_config(ESP_PD_DOMAIN_VDDSDIO, OFF) — niszczy PSRAM.

#--- Konsola: natywne USB-Serial-JTAG (303A:1001), płytka nie ma mostka ---------
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_PHY_ENABLE_USB=y

#--- mbedTLS: powód, dla którego cały ten stos to ESP-IDF ----------------------
# Certyfikat *.googleapis.com ma 17 nazw SAN. Żaden no_std-owy stos TLS ze stałymi
# tablicami tego nie zweryfikuje (embedded-tls: MAX_SAN_DNS_NAMES = 3).
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_MAX_CERTS=200
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
# NIE ZMNIEJSZAĆ. Google nie honoruje max_fragment_length z RFC 6066; mniejsza wartość
# to utajony, zależny od hosta błąd handshake'u (MBEDTLS_ERR_SSL_INVALID_RECORD).
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=2048
# WYŁĄCZONE PO ZDIAGNOZOWANEJ AWARII, i nie wolno tego włączyć z powrotem bez dowodu,
# że ESP-IDF to naprawiło. Domyślnie w IDF jest =n; my mieliśmy =y dla oszczędności RAM-u.
#
# Objaw: Guru Meditation (LoadProhibited) przy KAŻDEJ próbie HTTPS, zawsze w tym samym
# miejscu — mbedtls_ssl_get_base_mode() czytające transform->cipher_ctx_dec.cipher_info.
# EXCVADDR za każdym razem INNY (0x80606f76, 0xc032be5b, 0xc3517e98), czyli wskaźnik
# pokazywał na zwolnioną i ponownie użytą pamięć.
#
# Ścieżka z backtrace'u:
#   ssl_tls13_process_encrypted_extensions -> mbedtls_ssl_read_record
#   -> mbedtls_ssl_decrypt_buf -> mbedtls_ssl_get_mode_from_transform  [BUM]
# opakowana przez __wrap_mbedtls_ssl_tls13_handshake_client_step
# z components/mbedtls/port/dynamic/esp_ssl_cli.c — czyli wprost przez TĘ opcję.
#
# Dynamiczne bufory zwalniają i odtwarzają bufory mbedTLS między krokami uścisku dłoni.
# Na ścieżce TLS 1.3 (EncryptedExtensions przychodzą JUŻ zaszyfrowane, tuż po ServerHello)
# gubią przy tym kontekst szyfru. To nie był brak pamięci: w chwili awarii wolnego
# wewnętrznego DRAM-u było 190 KB.
#
# Koszt wyłączenia jest znikomy: bufor wejściowy 16 KB żyje przez całe połączenie zamiast
# być zwalnianym między krokami, a przy SPIRAM_MALLOC_ALWAYSINTERNAL=4096 i tak ląduje
# w PSRAM-ie, którego jest 8 MB.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=n
CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y
CONFIG_MBEDTLS_SSL_PROTO_TLS1_3=y
CONFIG_MBEDTLS_CLIENT_SSL_SESSION_TICKETS=y
# Z ALWAYSINTERNAL=4096 bufor wejściowy 16 KB i tak ląduje w PSRAM. EXTERNAL_MEM_ALLOC
# zepchnąłby tam WSZYSTKIE alokacje mbedTLS, łącznie ze źródłami DMA dla sprzętowego AES/SHA.
CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC=y
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_HARDWARE_SHA=y
CONFIG_MBEDTLS_HARDWARE_MPI=y
CONFIG_MBEDTLS_HAVE_TIME=y
# Celowo =n w v1: przy =y padnięta bateryjka RTC albo zablokowany NTP ZAMURUJE
# urządzenie (SNTP nie przejdzie po HTTPS, a HTTPS nie przejdzie bez czasu).
# Świeżość danych pilnujemy programowo. Przełącz na =y, gdy ścieżka RTC będzie sprawdzona.
CONFIG_MBEDTLS_HAVE_TIME_DATE=n

#--- lwIP / SNTP ---------------------------------------------------------------
CONFIG_LWIP_IPV6=n
CONFIG_LWIP_MAX_SOCKETS=8
CONFIG_LWIP_SO_RCVBUF=y
# Domyślnie 1 — przy tej wartości SntpConf::default() po cichu gubi 3 z 4 serwerów puli.
CONFIG_LWIP_SNTP_MAX_SERVERS=4
# Domyślnie y, co daje DO 5000 ms LOSOWEGO czasu z włączonym radiem na każde wybudzenie,
# dla thundering herd, którego i tak nie jesteśmy częścią.
CONFIG_LWIP_SNTP_STARTUP_DELAY=n
CONFIG_LWIP_SNTP_UPDATE_DELAY=3600000

#--- Wi-Fi ---------------------------------------------------------------------
CONFIG_ESP_PHY_MAX_WIFI_TX_POWER=13
CONFIG_ESP_WIFI_SLP_IRAM_OPT=y
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=y
CONFIG_LWIP_ESP_GRATUITOUS_ARP=n

#--- Stosy (std Rust potrzebuje więcej niż C) ----------------------------------
# 64 KB, podniesione z 32 KB po stack overflow w parsowaniu kanału 1,18 MB.
#
# ZMIERZONE NA SPRZĘCIE, uxTaskGetStackHighWaterMark w czterech punktach cyklu:
#   pobieram          46652 B wolne
#   pobrane           45036 B      -> transport i mbedTLS: ~1,6 KB
#   parsuję bez radia 45036 B
#   sparsowane        25036 B      -> parsowanie i rozwijanie reguł: 20,0 KB
# Szczyt zużycia: 65536 - 25036 = 40,5 KB.
#
# Przy 32 KB brakowało 8,5 KB i przepełnienie było nieuniknione. Zużycie jest
# OGRANICZONE I POWTARZALNE — to nie jest rozbiegająca się rekursja, tylko tyle,
# ile ten parser potrzebuje. Dlatego 64 KB jest naprawą, a nie zamiataniem;
# zapas nad zmierzonym szczytem wynosi 25 KB.
#
# 64 KB ZOSTAJE także po przeniesieniu budowy regexów na osobny wątek. Powód jest
# niezależny od kroku sieciowego: statyczna analiza ramek pokazuje, że ścieżka
# RYSOWANIA (interactive_loop -> repaint -> render_frame -> Fonts::embedded ->
# ttf_parser) sięga 32 688 B, czyli osiemdziesiąt bajtów pod progiem 32 768.
# Ostatni obraz, o którym wiemy, że działał, miał na ścieżce sieciowej 2 720 B
# zapasu — 8%. Powrót do 32 KB wymagałby naprawienia trzech rzeczy naraz, nie jednej.
#
# Cena: 32 KB wewnętrznego DRAM-u zabrane ze sterty na stałe. Log pokazuje przy
# pobieraniu 157 KB wolnego, więc mieści się, ale to jest ten sam DRAM, o który
# biją się mbedTLS i epdiy — przy dokładaniu czegokolwiek do kroku sieciowego
# porównuj te liczby.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=65536
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=4096
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=8192
# CONFIG_FREERTOS_UNICORE zostaje WYŁĄCZONE: epdiy odpala zadania renderujące na obu rdzeniach.

#--- Watchdogi -----------------------------------------------------------------
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
# Domyślne n jest ZŁE dla urządzenia bateryjnego bez opieki: zawieszony task
# rozładuje ogniwo do zera.
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
# Blokujące wypchnięcie klatki na panel zagładza task idle.
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
CONFIG_ESP_INT_WDT=y
CONFIG_ESP_INT_WDT_TIMEOUT_MS=800
CONFIG_BOOTLOADER_WDT_ENABLE=y
CONFIG_BOOTLOADER_WDT_TIME_MS=9000

#--- Brownout ------------------------------------------------------------------
# NAJNIŻSZY próg, celowo. Detektor pilnuje szyny 3.3 V. Impuls 350 mA przy nadawaniu
# WiFi na zużytym ogniwie przez LDO ME6217 nie może stać się pętlą resetów, a reset
# w trakcie odświeżania z podniesionymi szynami TPS65185 to jedyna naprawdę
# szkodliwa awaria na tej płytce. Prawdziwe odcięcie robimy programowo z BQ27220.
CONFIG_ESP_BROWNOUT_DET=y
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y

#--- Logi / rozmiar ------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# Wykompilowuje każdy format string z ESP_LOGD/ESP_LOGV.
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y

#--- Deskryptor aplikacji ------------------------------------------------------
CONFIG_APP_COMPILE_TIME_DATE=y
# OTA weszło. Świeżo wgrany obraz startuje w stanie PENDING_VERIFY i musi zawołać
# esp_ota_mark_app_valid_cancel_rollback() przed kolejnym resetem, inaczej bootloader
# wraca do poprzedniego slotu. Wołamy to na końcu udanego cyklu — patrz
# `net::ota::mark_running_valid`.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
